vinaib/arm_asm/m/st/STM32CubeIDE 1.2.0_Workspace/006_STM32F446RE_DRIVERS/Drivers/src/stm32f446re_usart.c
/*
 * stm32f466re_usart.c
 *
 *  Created on: 15-May-2020
 *      Author: GAYATHRI
 */

#include<stm32f446re_rcc.h>
#include<stm32f446re_usart.h>

/* ****************************************************************************************
* @fn 				- USART_PeriClockControl
*
* @breif			- Application has to implement this event call back
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void USART_PeriClockControl(USART_RegDef_t *pUSARTx, uint8_t EnorDi)
{
	if(EnorDi == ENABLE) {
		if(pUSARTx == USART1) {
			USART1_CLK_EN();
		}else if(pUSARTx == USART2) {
			USART2_CLK_EN();
		}else if(pUSARTx == USART3) {
			USART3_CLK_EN();
		}else if(pUSARTx == UART4) {
			UART4_CLK_EN();
		}else if(pUSARTx == UART5) {
			UART5_CLK_EN();
		}else if(pUSARTx == USART6) {
			USART6_CLK_EN();
		}
	}else if(EnorDi == DISABLE) {
		if(pUSARTx == USART1) {
			USART1_CLK_DI();
		}else if(pUSARTx == USART2) {
			USART2_CLK_DI();
		}else if(pUSARTx == USART3) {
			USART3_CLK_DI();
		}else if(pUSARTx == UART4) {
			UART4_CLK_DI();
		}else if(pUSARTx == UART5) {
			UART5_CLK_DI();
		}else if(pUSARTx == USART6) {
			USART6_CLK_DI();
		}
	} else {
		/* error invalid param */
	}
}

/* ****************************************************************************************
* @fn 				- USART_Init
*
* @breif			- Application has to implement this event call back
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void USART_Init(USART_Handle_t *pUSARTHandle)
{

	//Temporary variable
	uint32_t tempreg=0;

/******************************** Configuration of CR1******************************************/

	//Implement the code to enable the Clock for given USART peripheral
	USART_PeriClockControl(pUSARTHandle->pUSARTx, ENABLE);

	//Enable USART Tx and Rx engines according to the USART_Mode configuration item
	if ( pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_RX)
	{
		//Implement the code to enable the Receiver bit field
		tempreg|= (1 << USART_CR1_RE);
	}else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_TX)
	{
		//Implement the code to enable the Transmitter bit field
		tempreg |= ( 1 << USART_CR1_TE);

	}else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_TXRX)
	{
		//Implement the code to enable the both Transmitter and Receiver bit fields
		tempreg |= ( ( 1 << USART_CR1_RE) | ( 1 << USART_CR1_TE) );
	}

    //Implement the code to configure the Word length configuration item
	tempreg |= (pUSARTHandle->USART_Config.USART_WordLength << USART_CR1_M);


    //Configuration of parity control bit fields
	if ( pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_EVEN)
	{
		//Implement the code to enable the parity control
		tempreg |= ( 1 << USART_CR1_PCE);

		//Implement the code to enable EVEN parity
		//Not required because by default EVEN parity will be selected once you enable the parity control

	}else if (pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_ODD )
	{
		//Implement the code to enable the parity control
	    tempreg |= ( 1 << USART_CR1_PCE);

	    //Implement the code to enable ODD parity
	    tempreg |= ( 1 << USART_CR1_PS);

	}

   //Program the CR1 register
	pUSARTHandle->pUSARTx->CR1 = tempreg;

/******************************** Configuration of CR2******************************************/

	tempreg=0;

	//Implement the code to configure the number of stop bits inserted during USART frame transmission
	tempreg |= pUSARTHandle->USART_Config.USART_NoofStopBits << USART_CR2_STOP;

	//Program the CR2 register
	pUSARTHandle->pUSARTx->CR2 = tempreg;

/******************************** Configuration of CR3******************************************/

	tempreg=0;

	//Configuration of USART hardware flow control
	if ( pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS)
	{
		//Implement the code to enable CTS flow control
		tempreg |= ( 1 << USART_CR3_CTSE);


	}else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_RTS)
	{
		//Implement the code to enable RTS flow control
		tempreg |= (1 << USART_CR3_RTSE);

	}else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS_RTS)
	{
		//Implement the code to enable both CTS and RTS Flow control
		tempreg |= (( 1 << USART_CR3_CTSE) | (1 << USART_CR3_RTSE));
	}


	pUSARTHandle->pUSARTx->CR3 = tempreg;

/******************************** Configuration of BRR(Baudrate register)******************************************/

	//Implement the code to configure the baud rate
	USART_SetBaudRate(pUSARTHandle->pUSARTx, pUSARTHandle->USART_Config.USART_Baud);
}

/* ****************************************************************************************
* @fn 				- USART_DeInit
*
* @breif			- Application has to implement this event call back
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void USART_DeInit(USART_RegDef_t *pUSARTx)
{
	if(pUSARTx == USART1) {
		USART1_REG_RESET();
	}else if(pUSARTx == USART2) {
		USART2_REG_RESET();
	}else if(pUSARTx == USART3) {
		USART3_REG_RESET();
	}else if(pUSARTx == UART4) {
		UART4_REG_RESET();
	}else if(pUSARTx == UART5) {
		UART5_REG_RESET();
	}else if(pUSARTx == USART6) {
		USART6_REG_RESET();
	}
}

/* ****************************************************************************************
* @fn 				- USART_SendData
*
* @breif			- Application has to implement this event call back
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void USART_SendData(USART_Handle_t *pUSARTHandle, uint8_t *pTxBuffer, uint32_t Len)
{

	uint16_t *pdata;
	//Loop over until "Len" number of bytes are transferred
	for(uint32_t i = 0 ; i < Len; i++)
	{
		//Implement the code to wait until TXE flag is set in the SR
		while(! USART_GetFlagStatus(pUSARTHandle->pUSARTx,USART_FLAG_SR_TXE));

		 //Check the USART_WordLength item for 9BIT or 8BIT in a frame
		if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
		{
			//if 9BIT, load the DR with 2bytes masking the bits other than first 9 bits
			pdata = (uint16_t*) pTxBuffer;
			pUSARTHandle->pUSARTx->DR = (*pdata & (uint16_t)0x01FF);

			//check for USART_ParityControl
			if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
			{
				//No parity is used in this transfer. so, 9bits of user data will be sent
				//Implement the code to increment pTxBuffer twice
				pTxBuffer++;
				pTxBuffer++;
			}
			else
			{
				//Parity bit is used in this transfer . so , 8bits of user data will be sent
				//The 9th bit will be replaced by parity bit by the hardware
				pTxBuffer++;
			}
		}
		else
		{
			//This is 8bit data transfer
			pUSARTHandle->pUSARTx->DR = (*pTxBuffer  & (uint8_t)0xFF);

