vinaib/arm_asm/m/st/STM32CubeIDE 1.2.0_Workspace/006_STM32F446RE_DRIVERS/Drivers/src/stm32f446re_usart.c
			//Implement the code to increment the buffer address
			pTxBuffer++;
		}
	}

	//Implement the code to wait till TC flag is set in the SR
	while( ! USART_GetFlagStatus(pUSARTHandle->pUSARTx,USART_FLAG_SR_TC));

}

/* ****************************************************************************************
* @fn 				- USART_ReceiveData
*
* @breif			- Application has to implement this event call back
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void USART_ReceiveData(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len)
{
	//Loop over until "Len" number of bytes are transferred
	for(uint32_t i = 0 ; i < Len; i++)
	{
		//Implement the code to wait until RXNE flag is set in the SR
		while(!USART_GetFlagStatus(pUSARTHandle->pUSARTx, USART_FLAG_SR_RXNE));

		//Check the USART_WordLength to decide whether we are going to receive 9bit of data in a frame or 8 bit
		if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
		{
			//We are going to receive 9bit data in a frame

			//check are we using USART_ParityControl control or not
			if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
			{
				//No parity is used. so, all 9bits will be of user data

				//read only first 9 bits. so, mask the DR with 0x01FF
				*((uint16_t*) pRxBuffer) = (pUSARTHandle->pUSARTx->DR  & (uint16_t)0x01FF);

				//Now increment the pRxBuffer two times
				pRxBuffer++;
				pRxBuffer++;
			}
			else
			{
				//Parity is used, so, 8bits will be of user data and 1 bit is parity
				 *pRxBuffer = (pUSARTHandle->pUSARTx->DR  & (uint8_t)0xFF);

				 //Increment the pRxBuffer
				 pRxBuffer++;
			}
		}
		else
		{
			//We are going to receive 8bit data in a frame

			//check are we using USART_ParityControl control or not
			if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
			{
				//No parity is used , so all 8bits will be of user data

				//read 8 bits from DR
				 *pRxBuffer = (pUSARTHandle->pUSARTx->DR  & (uint8_t)0xFF);
			}

			else
			{
				//Parity is used, so , 7 bits will be of user data and 1 bit is parity

				//read only 7 bits , hence mask the DR with 0X7F
				 *pRxBuffer =  (pUSARTHandle->pUSARTx->DR  & (uint8_t)0x7F);

			}

			//increment the pRxBuffer
			pRxBuffer++;
		}
	}

}

/* ****************************************************************************************
* @fn 				- USART_SendDataIT
*
* @breif			- Application has to implement this event call back
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
uint8_t USART_SendDataIT(USART_Handle_t *pUSARTHandle,uint8_t *pTxBuffer, uint32_t Len)
{
/*	uint8_t txstate = pUSARTHandle->TODO;

	if(txstate != USART_BUSY_IN_TX)
	{
		pUSARTHandle->TODO = Len;
		pUSARTHandle->pTxBuffer = TODO;
		pUSARTHandle->TxBusyState = TODO;

		//Implement the code to enable interrupt for TXE
		TODO


		//Implement the code to enable interrupt for TC
		TODO


	}

	return txstate;*/
}

/* ****************************************************************************************
* @fn 				- USART_ReceiveDataIT
*
* @breif			- Application has to implement this event call back
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
uint8_t USART_ReceiveDataIT(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len)
{
/*	uint8_t rxstate = pUSARTHandle->TODO;

	if(rxstate != TODO)
	{
		pUSARTHandle->RxLen = Len;
		pUSARTHandle->pRxBuffer = TODO;
		pUSARTHandle->RxBusyState = TODO;

		//Implement the code to enable interrupt for RXNE
		TODO

	}

	return rxstate;*/
}

/* ****************************************************************************************
* @fn 				- USART_IRQInterruptConfig
*
* @breif			- Application has to implement this event call back
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void USART_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi)
{
	if(EnorDi == ENABLE) {
		if(IRQNumber <= 31) {		//0 to 31
			//Program ISER0 register
			*(NVIC_ISER0) |= (1 << IRQNumber);
		}else if(IRQNumber > 31 && IRQNumber < 64) {	//32 to 63
			//Program ISER1 register
			*(NVIC_ISER1) |= (1 << (IRQNumber %32));
		}else if(IRQNumber >=64  && IRQNumber < 96) {	//64 to 95
			//Program ISER2 register
			*(NVIC_ISER2) |= (1 << (IRQNumber %64));
		}
	} else {
		if(IRQNumber <= 31) {		//0 to 31
			//Program ICER0 register
			*(NVIC_ICER0) |= (1 << IRQNumber);
		}else if(IRQNumber > 31 && IRQNumber < 64) {	//32 to 63
			//Program ICER1 register
			*(NVIC_ICER1) |= (1 << (IRQNumber %32));
		}else if(IRQNumber >=64  && IRQNumber < 96) {	//64 to 95
			//Program ICSER2 register
			*(NVIC_ICER2) |= (1 << (IRQNumber %64));
		}
	}
}

/* ****************************************************************************************
* @fn 				- USART_IRQPriorityConfig
*
* @breif			- Application has to implement this event call back
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void USART_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority)
{
	//1. first let find out the ipr register
	uint8_t iprx = IRQNumber / 4;
	uint8_t iprx_section = IRQNumber % 4;

	uint8_t shift_amount = (8 * iprx_section) + (8 - NO_PR_BITS_IMPLEMENTED);

	*(NVIC_PR_BASE_ADDR + iprx) |= (uint32_t)(IRQPriority << shift_amount);
}

/* ****************************************************************************************
* @fn 				- USART_IRQHandling
*
* @breif			- Application has to implement this event call back
*
* @param[in]		-
* @param[in]		-
* @param[in]		-
*
* @return			- none
*
* @note				- none
**/
void USART_IRQHandling(USART_Handle_t *pUSARTHandle)
{
/*
	uint32_t temp1 , temp2, temp3;

	uint16_t *pdata;

************************Check for TC flag *******************************************

    //Implement the code to check the state of TC bit in the SR
	temp1 = pUSARTHandle->pUSARTx->SR & ( 1 << USART_SR_TC);

